```
SETUP: tests/aws_route53_zone []

PRETEST: tests/aws_route53_zone

TEST: tests/aws_route53_zone
Running terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.aws_route53_example_com will be created
  + resource "aws_cloudwatch_log_group" "aws_route53_example_com" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/route53/turbottest44337.com"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_resource_policy.route53-query-logging-policy will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53-query-logging-policy" {
      + id              = (known after apply)
      + policy_document = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "route53.amazonaws.com"
                        }
                      + Resource  = "arn:aws:logs:*:*:log-group:/aws/route53/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_name     = "route53-query-logging-policy"
    }

  # aws_kms_key.example will be created
  + resource "aws_kms_key" "example" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "ECC_NIST_P256"
      + deletion_window_in_days  = 7
      + description              = (known after apply)
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "SIGN_VERIFY"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "api-service.dnssec.route53.aws.internal"
                        }
                      + Sid       = "Route 53 DNSSEC Permissions"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                 = (known after apply)
    }

  # aws_route53_hosted_zone_dnssec.example will be created
  + resource "aws_route53_hosted_zone_dnssec" "example" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # aws_route53_key_signing_key.example will be created
  + resource "aws_route53_key_signing_key" "example" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (known after apply)
      + key_tag                    = (known after apply)
      + name                       = "turbottest44337"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # aws_route53_query_log.example_com will be created
  + resource "aws_route53_query_log" "example_com" {
      + cloudwatch_log_group_arn = (known after apply)
      + id                       = (known after apply)
      + zone_id                  = (known after apply)
    }

  # aws_route53_zone.named_test_resource will be created
  + resource "aws_route53_zone" "named_test_resource" {
      + comment       = "Test zone"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "turbottest44337.com"
      + name_servers  = (known after apply)
      + tags          = {
          + "name" = "turbottest44337"
        }
      + tags_all      = {
          + "name" = "turbottest44337"
        }
      + zone_id       = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + account_id                 = "986325076436"
  + aws_region                 = "us-east-1"
  + cloudwatch_log_group_arn   = (known after apply)
  + digest_algorithm_mnemonic  = (known after apply)
  + kms_arn                    = (known after apply)
  + logging_configuration_id   = (known after apply)
  + resource_aka               = (known after apply)
  + resource_name              = "turbottest44337"
  + signing_algorithm_mnemonic = (known after apply)
  + zone_id                    = (known after apply)
aws_cloudwatch_log_resource_policy.route53-query-logging-policy: Creating...
aws_route53_zone.named_test_resource: Creating...
aws_kms_key.example: Creating...
aws_cloudwatch_log_resource_policy.route53-query-logging-policy: Creation complete after 2s [id=route53-query-logging-policy]
aws_kms_key.example: Creation complete after 6s [id=8002b617-eeb7-4bc5-9025-457ce99e6220]
aws_route53_zone.named_test_resource: Still creating... [10s elapsed]
aws_route53_zone.named_test_resource: Still creating... [20s elapsed]
aws_route53_zone.named_test_resource: Still creating... [30s elapsed]
aws_route53_zone.named_test_resource: Still creating... [40s elapsed]
aws_route53_zone.named_test_resource: Still creating... [50s elapsed]
aws_route53_zone.named_test_resource: Still creating... [1m0s elapsed]
aws_route53_zone.named_test_resource: Still creating... [1m10s elapsed]
aws_route53_zone.named_test_resource: Still creating... [1m20s elapsed]
aws_route53_zone.named_test_resource: Creation complete after 1m21s [id=Z01991178X3FN48S63SP]
aws_cloudwatch_log_group.aws_route53_example_com: Creating...
aws_route53_key_signing_key.example: Creating...
aws_cloudwatch_log_group.aws_route53_example_com: Creation complete after 5s [id=/aws/route53/turbottest44337.com]
aws_route53_query_log.example_com: Creating...
aws_route53_query_log.example_com: Creation complete after 3s [id=44737168-b123-488d-a4fa-41c70683d7b8]
aws_route53_key_signing_key.example: Still creating... [10s elapsed]
aws_route53_key_signing_key.example: Still creating... [20s elapsed]
aws_route53_key_signing_key.example: Still creating... [30s elapsed]
aws_route53_key_signing_key.example: Still creating... [40s elapsed]
aws_route53_key_signing_key.example: Still creating... [50s elapsed]
aws_route53_key_signing_key.example: Creation complete after 55s [id=Z01991178X3FN48S63SP,turbottest44337]
aws_route53_hosted_zone_dnssec.example: Creating...
aws_route53_hosted_zone_dnssec.example: Still creating... [10s elapsed]
aws_route53_hosted_zone_dnssec.example: Still creating... [20s elapsed]
aws_route53_hosted_zone_dnssec.example: Still creating... [30s elapsed]
aws_route53_hosted_zone_dnssec.example: Still creating... [40s elapsed]
aws_route53_hosted_zone_dnssec.example: Still creating... [50s elapsed]
aws_route53_hosted_zone_dnssec.example: Still creating... [1m0s elapsed]
aws_route53_hosted_zone_dnssec.example: Creation complete after 1m7s [id=Z01991178X3FN48S63SP]

Warning: Deprecated Resource

  with data.null_data_source.resource,
  on variables.tf line 44, in data "null_data_source" "resource":
  44: data "null_data_source" "resource" {

The null_data_source was historically used to construct intermediate values
to re-use elsewhere in configuration, the same can now be achieved using
locals

(and one more similar warning elsewhere)

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

Outputs:

account_id = "986325076436"
aws_region = "us-east-1"
cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:986325076436:log-group:/aws/route53/turbottest44337.com"
digest_algorithm_mnemonic = "SHA-256"
kms_arn = "arn:aws:kms:us-east-1:986325076436:key/8002b617-eeb7-4bc5-9025-457ce99e6220"
logging_configuration_id = "44737168-b123-488d-a4fa-41c70683d7b8"
resource_aka = "arn:aws:route53:::hostedzone/Z01991178X3FN48S63SP"
resource_name = "turbottest44337"
signing_algorithm_mnemonic = "ECDSAP256SHA256"
zone_id = "Z01991178X3FN48S63SP"

Running SQL query: test-get-query.sql
[
  {
    "comment": "Test zone",
    "id": "Z01991178X3FN48S63SP",
    "name": "turbottest44337.com.",
    "private_zone": false,
    "resource_record_set_count": 2
  }
]
✔ PASSED

Running SQL query: test-hydrate-query.sql
[
  {
    "digest_algorithm_mnemonic": "SHA-256",
    "kms_arn": "arn:aws:kms:us-east-1:986325076436:key/8002b617-eeb7-4bc5-9025-457ce99e6220",
    "name": "turbottest44337.com.",
    "query_logging_configs": [
      {
        "CloudWatchLogsLogGroupArn": "arn:aws:logs:us-east-1:986325076436:log-group:/aws/route53/turbottest44337.com",
        "HostedZoneId": "Z01991178X3FN48S63SP",
        "Id": "44737168-b123-488d-a4fa-41c70683d7b8"
      }
    ],
    "signing_algorithm_mnemonic": "ECDSAP256SHA256",
    "tags_src": [
      {
        "Key": "name",
        "Value": "turbottest44337"
      }
    ]
  }
]
✔ PASSED

Running SQL query: test-invalid-id-query.sql
null
✔ PASSED

Running SQL query: test-list-query.sql
[
  {
    "comment": "Test zone",
    "id": "Z01991178X3FN48S63SP",
    "name": "turbottest44337.com."
  }
]
✔ PASSED

Running SQL query: test-not-found-query.sql
null
✔ PASSED

Running SQL query: test-turbot-query.sql
[
  {
    "akas": [
      "arn:aws:route53:::hostedzone/Z01991178X3FN48S63SP"
    ],
    "tags": {
      "name": "turbottest44337"
    },
    "title": "turbottest44337.com."
  }
]
✔ PASSED

POSTTEST: tests/aws_route53_zone

TEARDOWN: tests/aws_route53_zone

SUMMARY:

1/1 passed.
```